title: Selector
status: experimental
description: Detects usage of cmdkey to look for cached credentials.
reference: 
    - https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
    - https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
author: jmallette
logsource:
    product: windows
    service: sysmon
detection:
    selector:
        EventID: 305
        Image: 'C:\Windows\System32\backgroundTaskHost.exe'
    condition: selector
fields:
    - CommandLine
    - ParentCommandLine
    - User
falsepositives:
    - Legitimate administrative tasks.
level: low
